==================
basic assignment
==================

a := 1.

---

(source_file
  (assignment_rule
    (simple_assignment
      (function
        (identifier))
      (number))))

==================
basic assignment rule
==================

a(X) := f(Y) :- b(X).

---

(source_file
  (assignment_rule
    (simple_assignment
      (function
        (identifier)
        (terms
          (variable)))
      (function
        (identifier)
        (terms
          (variable))))
    (body
      (body_literal
        (symbolic_atom
          (identifier)
          (terms
            (variable)))))))

==================
aggregate assignment
==================

a := #sum {X,Y: p(X,Y), q(X), not r(Y)}.

---

(source_file
  (assignment_rule
    (aggregate_assignment
      (function
        (identifier))
      (aggregate_assignment_aggregate
        (aggregate_function)
        (body_aggregate_elements
          (body_aggregate_element
            (terms
              (variable)
              (variable))
            (condition
              (literal
                (symbolic_atom
                  (identifier)
                  (terms
                    (variable)
                    (variable))))
              (literal
                (symbolic_atom
                  (identifier)
                  (terms
                    (variable))))
              (literal
                (default_negation)
                (symbolic_atom
                  (identifier)
                  (terms
                    (variable)))))))))))

==================
choice assignment
==================

a := #some{X,Y: p(X,Y), not in(X)}.

---

(source_file
  (assignment_rule
    (choice_some_assignment
      (function
        (identifier))
      (body_aggregate_elements
        (body_aggregate_element
          (terms
            (variable)
            (variable))
          (condition
            (literal
              (symbolic_atom
                (identifier)
                (terms
                  (variable)
                  (variable))))
            (literal
              (default_negation)
              (symbolic_atom
                (identifier)
                (terms
                  (variable))))))))))

==================
general choice assignment
==================

{ f(X) := Y : p(X,Y), not in(X) }.

---

(source_file
  (assignment_rule
    (choice_assignment
      (choice_assignment_elements
        (choice_assignment_element
          (simple_assignment
            (function
              (identifier)
              (terms
                (variable)))
            (variable))
          (condition
            (literal
              (symbolic_atom
                (identifier)
                (terms
                  (variable)
                  (variable))))
            (literal
              (default_negation)
              (symbolic_atom
                (identifier)
                (terms
                  (variable))))))))))

==================
general choice assignment 2
==================

{ f(X) := Y : p(X,Y), not in(X) ; q(X) : r(X) } = 1.

---

(source_file
  (assignment_rule
    (choice_assignment
      (choice_assignment_elements
        (choice_assignment_element
          (simple_assignment
            (function
              (identifier)
              (terms
                (variable)))
            (variable))
          (condition
            (literal
              (symbolic_atom
                (identifier)
                (terms
                  (variable)
                  (variable))))
            (literal
              (default_negation)
              (symbolic_atom
                (identifier)
                (terms
                  (variable))))))
        (set_aggregate_element
          (literal
            (symbolic_atom
              (identifier)
              (terms
                (variable))))
          (condition
            (literal
              (symbolic_atom
                (identifier)
                (terms
                  (variable)))))))
      (upper
        (relation)
        (number)))))

==================
cannot assign to number
:error
==================

1 := 1.

---



==================
cannot assign to string
:error
==================

"a" := 1.

---



==================
cannot assign to tuple
:error
==================

(a,b) := 1.

---


