==================
symbolic literal
==================

not p.

---

(source_file
  (rule
    (literal
      (default_negation)
      (symbolic_atom
        (identifier)))))

==================
comparison
==================

X < Y < Z.
 
---

(source_file
  (rule
    (literal
      (comparison
        (variable)
        (relation)
        (variable)
        (relation)
        (variable)))))

==================
boolean
==================

#true; #false.
 
---

(source_file
  (rule
    (disjunction
      (literal
        (boolean_constant))
      (literal
        (boolean_constant)))))

==================
disjunction
==================

p; p: q, c; d: ; |X| < 10.

---

(source_file
  (rule
    (disjunction
      (literal
        (symbolic_atom
          (identifier)))
      (conditional_literal
        (literal
          (symbolic_atom
            (identifier)))
        (condition
          (literal
            (symbolic_atom
              (identifier)))
          (literal
            (symbolic_atom
              (identifier)))))
      (conditional_literal
        (literal
          (symbolic_atom
            (identifier))))
      (literal
        (comparison
          (abs
            (variable))
          (relation)
          (number))))))

==================
head set aggregate
==================

1 <= { a; a: b, c } <= 2.

---

(source_file
  (rule
    (set_aggregate
      (lower
        (number)
        (relation))
      (set_aggregate_elements
        (set_aggregate_element
          (literal
            (symbolic_atom
              (identifier))))
        (set_aggregate_element
          (literal
            (symbolic_atom
              (identifier)))
          (condition
            (literal
              (symbolic_atom
                (identifier)))
            (literal
              (symbolic_atom
                (identifier))))))
      (upper
        (relation)
        (number)))))

==================
head aggregate
==================

1 <= #count { :a; 1:a:b,c; 1:a: } <= 2.

---

(source_file
  (rule
    (head_aggregate
      (lower
        (number)
        (relation))
      (aggregate_function)
      (head_aggregate_elements
        (head_aggregate_element
          (literal
            (symbolic_atom
              (identifier))))
        (head_aggregate_element
          (terms
            (number))
          (literal
            (symbolic_atom
              (identifier)))
          (condition
            (literal
              (symbolic_atom
                (identifier)))
            (literal
              (symbolic_atom
                (identifier)))))
        (head_aggregate_element
          (terms
            (number))
          (literal
            (symbolic_atom
              (identifier)))))
      (upper
        (relation)
        (number)))))

==================
head theory
==================

&p.

---

(source_file
  (rule
    (theory_atom
      (identifier))))
