==================
numbers
==================

p(0,9,0xf,0b1,0o7).

---

(source_file
  (rule
    (literal
      (symbolic_atom
        (identifier)
        (terms
          (number)
          (number)
          (number)
          (number)
          (number))))))

==================
constants
==================

p("abc", #inf, #sup).

---

(source_file
  (rule
    (literal
      (symbolic_atom
        (identifier)
        (terms
          (string
            (string_fragment))
          (infimum)
          (supremum))))))

==================
variables
==================

p(X,_,__'Xa').

---

(source_file
  (rule
    (literal
      (symbolic_atom
        (identifier)
        (terms
          (variable)
          (anonymous)
          (variable))))))

==================
unary
==================

p(-1,~1,|1;2|).

---

(source_file
  (rule
    (literal
      (symbolic_atom
        (identifier)
        (terms
          (unary_operation
            (number))
          (unary_operation
            (number))
          (abs
            (number)
            (number)))))))

==================
binary
==================

p(1-2,1*2,1**2,1/2,1\2).

---

(source_file
  (rule
    (literal
      (symbolic_atom
        (identifier)
        (terms
          (binary_operation
            (number)
            (number))
          (binary_operation
            (number)
            (number))
          (binary_operation
            (number)
            (number))
          (binary_operation
            (number)
            (number))
          (binary_operation
            (number)
            (number)))))))

==================
precedence
==================

p(1+2*3-4).

---

(source_file
  (rule
    (literal
      (symbolic_atom
        (identifier)
        (terms
          (binary_operation
            (binary_operation
              (number)
              (binary_operation
                (number)
                (number)))
            (number)))))))

==================
function
==================

p(f(),g,h(;1;1,2),@g).

---

(source_file
  (rule
    (literal
      (symbolic_atom
        (identifier)
        (terms
          (function
            (identifier))
          (function
            (identifier))
          (function
            (identifier)
            (empty_pool_item)
            (terms
              (number))
            (terms
              (number)
              (number)))
          (external_function
            (identifier)))))))

==================
tuple
==================

p((),(;a;a,;;a,b;a,b,)).

---

(source_file
  (rule
    (literal
      (symbolic_atom
        (identifier)
        (terms
          (tuple)
          (tuple
            (empty_pool_item)
            (function
              (identifier))
            (terms
              (function
                (identifier)))
            (empty_pool_item)
            (terms
              (function
                (identifier))
              (function
                (identifier)))
            (terms
              (function
                (identifier))
              (function
                (identifier)))))))))

==================
identifier
==================

p(n, no, noxt, a, -n, -no, -noxt, -a).

---

(source_file
  (rule
    (literal
      (symbolic_atom
        (identifier)
        (terms
          (function
            (identifier))
          (function
            (identifier))
          (function
            (identifier))
          (function
            (identifier))
          (unary_operation
            (function
              (identifier)))
          (unary_operation
            (function
              (identifier)))
          (unary_operation
            (function
              (identifier)))
          (unary_operation
            (function
              (identifier))))))))
